test-scenarios/app/artillery.yml
config:
  target: "http://localhost:3009"
  phases:
    - duration: 1
      arrivalRate: 1
  engines:
    socketio-v3: {}
scenarios:
  - name: First Scenario
    engine: socketio-v3
    flow:
      - emit: ["join", "lobby"]
        response:
          on: "joined"
          args: ["Welcome to lobby"]
      - emit: ["message", "lobby", "Hello everyone!"]
        response:
          on: message
          args:
            - lobby
            - Hello everyone!
          match:
            - json: "$.0"
              value: "lobby"
            - json: "$.1"
              value: "Hello everyone!"